In [1]:
import pandas as pd

**先查看具体一年(1880)的数据。**

因为没有头，所以要有names=['name', 'sex', 'births']

只要形式符合，txt格式的也能用read_csv读取

In [2]:
n1880 = pd.read_csv('D:/datas/babynames/yob1880.txt',names=['name', 'sex', 'births'])

In [3]:
n1880.head(3)

   name sex  births
0  Mary   F    7065
1  Anna   F    2604
2  Emma   F    2003

**接下来把所有年份的拼接起来**

In [4]:
years = range(1880,2011)
pieces = []
columns = ['name', 'sex', 'births']
for year in years:
    path = 'D:/datas/babynames/yob'+str(year)+'.txt'
    frame = pd.read_csv(path, names=columns)
    frame['year'] = year 
    pieces.append(frame)
names = pd.concat(pieces, ignore_index=True)

In [7]:
names.head()

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [8]:
names.tail()

              name sex  births  year
1690779    Zymaire   M       5  2010
1690780     Zyonne   M       5  2010
1690781  Zyquarius   M       5  2010
1690782      Zyran   M       5  2010
1690783      Zzyzx   M       5  2010

In [10]:
names.shape

(1690784, 4)

**每年男女的总数**

In [12]:
names.groupby(['year','sex']).births.sum()

year  sex
1880  F        90993
      M       110493
1881  F        91955
      M       100748
1882  F       107851
      M       113687
1883  F       112322
      M       104632
1884  F       129021
      M       114445
1885  F       133056
      M       107802
1886  F       144538
      M       110785
1887  F       145983
      M       101412
1888  F       178631
      M       120857
1889  F       178369
      M       110590
1890  F       190377
      M       111026
1891  F       185486
      M       101198
1892  F       212350
      M       122038
1893  F       212908
      M       112319
1894  F       222923
      M       115775
              ...
1996  F      1751681
      M      1892700
1997  F      1739331
      M      1883571
1998  F      1765390
      M      1909676
1999  F      1772139
      M      1918267
2000  F      1813960
      M      1961702
2001  F      1798284
      M      1940498
2002  F      1794358
      M      1938941
2003  F      1824406
      M      1972439
2004  F      1833005
      M      1981557
2005  F      1843890
      M      1993285
2006  F      1896468
      M      2050234
2007  F      1916888
      M      2069242
2008  F      1883645
      M      2032310
2009  F      1827643
      M      1973359
2010  F      1759010
      M      1898382
Name: births, Length: 262, dtype: int64